julianoes/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	}


	// Process eRPM frames from all channels on this timer
	process_capture_results();

	// Enable all channels configured as DShotInverted
	io_timer_set_enable(true, IOTimerChanMode_DshotInverted, IO_TIMER_ALL_MODES_CHANNELS);
}

void process_capture_results()
{
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

		uint8_t timer_channel_index = timer_channel - 1;
		uint8_t timer_index = timer_io_channels[output_channel].timer_index;

		if (!timer_configs[timer_index].initialized || !timer_configs[timer_index].initialized_channels[timer_channel_index]) {
      			continue;
		}

		// Calculate the period for each channel
		unsigned period = calculate_period(output_channel, timer_channel_index);
		//period = 0;
		bool print = counter % 499 == 0;
		if (print) printf("#%d -> t: %d, c: %d -> period: %d\n", output_channel, timer_index, timer_channel_index, period);

		continue;
		if (period == 0) {
			// If the parsing failed, set the eRPM to 0
			//_erpms[channel_index] = 0;

		} else if (period == 65408) {
			// Special case for zero motion (e.g., stationary motor)
			//_erpms[channel_index] = 0;

		} else {
			// Convert the period to eRPM
			//_erpms[channel_index] = (1000000 * 60) / period;
		}

		// We set it ready anyway, not to hold up other channels when used in round robin.
		if (timer_index == 1) {
			//_erpms_ready[channel_index] = true;
		}
	}
}

/**
* bits  1-11    - throttle value (0-47 are reserved, 48-2047 give 2000 steps of throttle resolution)
* bit   12      - dshot telemetry enable/disable
* bits  13-16   - XOR checksum
**/
void dshot_motor_data_set(unsigned channel, uint16_t throttle, bool telemetry)
{
	//static unsigned counter = 0;
	//bool print = counter % 499 == 0;
	//if (print) {
	//	printf("ch: %d: %d\n", channel, throttle);
	//}
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	if (!channel_initialized) {
		//if (print) {
		//	printf("not init\n");
		//}
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

	packet |= throttle << DSHOT_THROTTLE_POSITION;
	packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

	uint16_t csum_data = packet;

	/* XOR checksum calculation */
	csum_data >>= NIBBLES_SIZE;

	for (uint8_t i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
		checksum ^= (csum_data & 0x0F); // XOR data by nibbles
		csum_data >>= NIBBLES_SIZE;
	}

	if (_bidirectional) {
		packet |= ((~checksum) & 0x0F);

	} else {
		packet |= ((checksum) & 0x0F);
	}


	const io_timers_channel_mapping_element_t *mapping = &io_timers_channel_mapping.element[timer_index];
	uint8_t num_motors = mapping->channel_count_including_gaps;
	uint8_t timer_channel = timer_io_channels[channel].timer_channel - mapping->lowest_timer_channel;

	for (uint8_t motor_data_index = 0; motor_data_index < ONE_MOTOR_DATA_SIZE; motor_data_index++) {
		dshot_output_buffer[timer_index][motor_data_index * num_motors + timer_channel] =
			(packet & 0x8000) ? MOTOR_PWM_BIT_1 : MOTOR_PWM_BIT_0;  // MSB first
		packet <<= 1;
	}

	//counter++;
}

int up_dshot_arm(bool armed)
{
	return io_timer_set_enable(armed, _bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot,
				   IO_TIMER_ALL_MODES_CHANNELS);
}

int up_bdshot_num_erpm_ready(void)
{
	int num_ready = 0;

	for (unsigned i = 0; i < MAX_NUM_CHANNELS_PER_TIMER; ++i) {
		if (_erpms_ready[i]) {
			++num_ready;
		}
	}

	return num_ready;
}

int up_bdshot_get_erpm(uint8_t output_channel, int *erpm)
{
	uint8_t timer_index = timer_io_channels[output_channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	if (channel_initialized) {
		*erpm = _erpms[timer_channel_index];
		_erpms_ready[timer_channel_index] = false;
		return PX4_OK;
	}

	// this channel is not configured for dshot
	return PX4_ERROR;
}

int up_bdshot_channel_status(uint8_t channel)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	// TODO: track that each channel is communicating using the decode stats
	if (channel_initialized) {
		return 1;
	}

	return 0;
}

void up_bdshot_status(void)
{
	PX4_INFO("dshot driver stats:");

	if (_bidirectional) {
		PX4_INFO("Bidirectional DShot enabled");
	}

	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		PX4_INFO("output channel %d, timer index %d, timer channel %d (read %lu, failed nibble %lu, failed CRC %lu, zero %lu\n",
			 output_channel,
			 timer_io_channels[output_channel].timer_index,
			 timer_io_channels[output_channel].timer_channel,
			 read_ok[output_channel],
			 read_fail_nibble[output_channel],
			 read_fail_crc[output_channel],
			 read_fail_zero[output_channel]);
	}

	printf("\n");

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		printf("timer_index %d\n", timer_index);
		printf("dma_up_handle: 0x%lx\n", (unsigned long)timer_configs[timer_index].dma_up_handle);
		printf("enabled: %s\n", timer_configs[timer_index].enabled ? "yes" : "no");
		printf("initialized: %s\n", timer_configs[timer_index].initialized ? "yes" : "no");
		printf("bidirectional: %s\n", timer_configs[timer_index].bidirectional ? "yes" : "no");
		printf("timer index: %d\n", timer_configs[timer_index].timer_index);
		printf("num_dma_available: %d\n", timer_configs[timer_index].num_dma_available);

		for (uint8_t channel = 0; channel < MAX_NUM_CHANNELS_PER_TIMER; ++channel) {
			printf("channel: %d\n", channel);
			printf("  dma_ch_handle: 0x%lx\n", (long unsigned)timer_configs[timer_index].dma_ch_handle[channel]);
			printf("  enabled: %s\n", timer_configs[timer_index].enabled_channels[channel] ? "true" : "false");
			printf("  initialized: %s\n", timer_configs[timer_index].initialized_channels[channel] ? "true" : "false");
			printf("  captcomp: %s\n", timer_configs[timer_index].captcomp_channels[channel] ? "true" : "false");
		}
		printf("----\n");
	}	
}

uint8_t nibbles_from_mapped(uint8_t mapped)
{
	switch (mapped) {
	case 0x19:
		return 0x00;

	case 0x1B:
		return 0x01;

