julianoes/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	case 0x12:
		return 0x02;

	case 0x13:
		return 0x03;

	case 0x1D:
		return 0x04;

	case 0x15:
		return 0x05;

	case 0x16:
		return 0x06;

	case 0x17:
		return 0x07;

	case 0x1a:
		return 0x08;

	case 0x09:
		return 0x09;

	case 0x0A:
		return 0x0A;

	case 0x0B:
		return 0x0B;

	case 0x1E:
		return 0x0C;

	case 0x0D:
		return 0x0D;

	case 0x0E:
		return 0x0E;

	case 0x0F:
		return 0x0F;

	default:
		// Unknown mapped
		return 0xFF;
	}
}

unsigned calculate_period(uint8_t output_channel, uint8_t channel_index)
{
	uint32_t value = 0;
	uint32_t high = 1; // We start off with high
	unsigned shifted = 0;

	// We can ignore the very first data point as it's the pulse before it starts.
	unsigned previous = dshot_capture_buffer[output_channel][1];


	// Loop through the capture buffer for the specified channel
	for (unsigned i = 2; i < CHANNEL_CAPTURE_BUFF_SIZE; ++i) {

		if (dshot_capture_buffer[output_channel][i] == 0) {
			// Once we get zeros we're through
			break;
		}

		// This seemss to work with dshot 150, 300, 600, 1200
		// The values were found by trial and error to get the quantization just right.
		const uint32_t bits = (dshot_capture_buffer[output_channel][i] - previous + 5) / 20;

		// Convert GCR encoded pulse train into value
		for (unsigned bit = 0; bit < bits; ++bit) {
			value = (value << 1) | high;
			++shifted;
		}

		// The next edge toggles.
		high = !high;

		previous = dshot_capture_buffer[output_channel][i];
	}

	if (shifted == 0) {
		// no data yet, or this time
		//++timer_configs[timer_index].read_fail_zero[channel_index];
		return 0;
	}

	// We need to make sure we shifted 21 times. We might have missed some low "pulses" at the very end.
	value <<= (21 - shifted);

	// From GCR to eRPM according to:
	// https://brushlesswhoop.com/dshot-and-bidirectional-dshot/#erpm-transmission
	unsigned gcr = (value ^ (value >> 1));

	uint32_t data = 0;


	// 20bits -> 5 mapped -> 4 nibbles
	for (unsigned i = 0; i < 4; ++i) {
		//uint32_t nibble = 0xff;
		uint32_t nibble = nibbles_from_mapped(gcr & 0x1F) << (4 * i);
		//nibble = 0xFF;

		if (nibble == 0xFF) {
			//++timer_configs[timer_index].read_fail_nibble[channel_index];;
			return 0;
		}

		data |= nibble;
		gcr >>= 5;
	}

	unsigned shift = (data & 0xE000) >> 13;
	unsigned period = ((data & 0x1FF0) >> 4) << shift;
	unsigned crc = data & 0xF;

	unsigned payload = (data & 0xFFF0) >> 4;
	unsigned calculated_crc = (~(payload ^ (payload >> 4) ^ (payload >> 8))) & 0x0F;

	if (crc != calculated_crc) {
		//++timer_configs[timer_index].read_fail_crc[channel_index];;
		return 0;
	}

	//++read_ok[output_channel];;

	//(void)period;
	//return 200;
	return period;
}

#endif
